# Cask
cask "alfred"
cask "docker-desktop"
cask "google-chrome"
cask "iterm2"
cask "spotify"
cask "google-drive"
cask "notunes"
cask "vlc"
cask "font-sauce-code-pro-nerd-font"
cask "yaak"
cask "jordanbaird-ice"
cask "zed"

# Native tools
brew "fish"
brew "git"
brew "neovim"
brew "tmux"

# Dev utils
brew "ripgrep"
brew "fzf"
brew "jq"
brew "difftastic"
brew "mise"

# System tools
brew "pstree"
brew "tree"
brew "starship"
brew "stow"
brew "zoxide"

# Utilities
brew "bitwarden-cli"
