# Tap
tap "homebrew/cask-fonts"

# Cask
cask "alfred"
cask "alt-tab"
cask "amethyst"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "spotify"
cask "visual-studio-code"
cask "google-drive"
cask "notunes"
cask "vlc"
cask "font-sauce-code-pro-nerd-font"
cask "messenger"
cask "whatsapp"

# Native tools
brew "fish"
brew "git"
brew "neovim"
brew "tmux"

# Dev utils
brew "ripgrep"
brew "fzf"
brew "jq"
brew "direnv"
brew "difftastic"

# System tools
brew "pstree"
brew "tree"
brew "starship"
brew "stow"
brew "zoxide"

# Utilities
brew "bitwarden-cli"

# Runtimes
brew "nodejs"
